import { ref } from 'vue';

const spotData = ref([
  {
    leftTitle: '顶尖',
    rightTitle: '独家资源',
    description: [
      '随着多年以来的积累，鹿名凝聚着最核心、最顶尖的国际名校招生官、校董、校园管理层、以及名师资源。这些独有的资源渠道是鹿名留学申请服务短时间帮助学员完成申请、低分高录、名校精准保录最坚实的保障。除此之外，鹿名国际拥有庞大的金牌导师团队，专属于学业管家服务，他们包括了来自哈佛大学、耶鲁大学、剑桥大学、牛津大学、麻省理工大学、悉尼大学等遍布全球300+高校的教授和学霸导师，全面覆盖不同学科和专业，确保学生进入名校的同时顺利毕业。',
    ],
    spotUrl: 'points/1.jpeg',
  },
  {
    leftTitle: '只申',
    rightTitle: '顶尖名校',
    description: [
      '不同于其他留学机构为学生申请排名低的保底学校，我们深知留学是人生大事，不能将就。所以，鹿名国际专注于为学生保录取到世界最顶尖的高校，助力他们实现心目中的名校梦。通过鹿名国际独有的全球名校资源以及学生自身的基本情况和背景，我们致力于和学生一起精挑细选出最适合他自己特点和理想的世界级名校。',
    ],
    spotUrl: 'points/2.jpeg',
  },
  {
    leftTitle: '保证',
    rightTitle: '名校录取',
    description: [
      '鹿名国际的留学申请只做保录取，不录取全额退款甚至赔款，这是鹿名的信心也是和其他留学中介机构最大的不同之处。鹿名学员不需要自身成绩和背景多么优秀，也不需要后续参加任何成绩和背景提升的额外培训，鹿名能够保证学员进入比其自身条件更高的世界级名校。',
    ],
    spotUrl: 'points/3.jpg',
  },
  {
    leftTitle: '保证',
    rightTitle: '顺利毕业',
    description: [
      '鹿名国际为学员们专属打造了“保姆式”学业管家服务，为确保学员们顺利毕业保驾护航。学员们在不需要担心毕业问题的同时，可以将更多精力投入到探索自身兴趣爱好和特长上，结合鹿名学业管家提供的全年课程规划与学业辅导、专业规划、职业规划、就业机会和校外活动机会等，增加实战经验、发掘自身潜力、提升专业技能和综合素养。',
    ],
    spotUrl: 'points/4.jpg',
  },
  {
    leftTitle: '优质',
    rightTitle: '专属服务',
    description: [
      '每一位鹿名学员都配有一位全职申请顾问老师7*24小时提供咨询服务和帮助。鹿名学业管家同样提供全方位支持与协同不限课时，不限答疑。每一位学员都配有专属助教，全方位实时跟进学习情况。微信群内同步教学系统，提醒学生重要事项、发布课件/笔记、跟踪平时成绩、分析评语反馈，投喂We- Education专属学习资源; 全方位帮助学生快速进入学习状态、学期中查漏补缺、期末提早复习备考。与导师、专家、家长、学生保持沟通，及时了解并处理学生家长提出的问题与反馈，协调多方之间的信息沟通，有益于家长随时了解学生近况。',
    ],
    spotUrl: 'points/5.jpg',
  },
  {
    leftTitle: '保障',
    rightTitle: '交易安全',
    description: [
      '鹿名国际在中国和美国均注册有实体公司，支持合同面签和公帐收款，有任何问题   随时可以找到鹿名，确保资金无风险。鹿名深知保录取往往金额较大，选择一家低首付的公司也是对客户资金安全的保障。其次，鹿名杜绝使用任何伪造成绩单或不实的背景材料，并且鹿名录取的学校都是真实可查，本科研究生录取率稳定99%以上。鹿名为学生只申请一至三所学校，而并非多所学校来拼概率。最后，鹿名承诺不录取全额退款！部分项目可以接受公平对赌，若无录取则赔偿客户！',
    ],
    spotUrl: 'points/6.jpg',
  },
]);

export default {
  spotData,
};
